src/Catalogs/ПравилаКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыОбменов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииОтправителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииПолучателя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПравилаКонвертации/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ИзменитьВерсии(ТекущаяСтрока, Действие, Сторона, Версия, ЗаменяемаВерсия = Неопределено)
	
	об = ТекущаяСтрока.Ссылка.ПолучитьОбъект();
	Если Ложь Тогда об = Справочники.ПравилаКонвертации.СоздатьЭлемент() КонецЕсли;
	Если Действие = "Заменить" Тогда
		Если Сторона = "Отправитель" Тогда
			стр = об.ВерсииОтправителя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				стр.Версия = Версия;
			КонецЕсли;
			
		Иначе
			стр = об.ВерсииПолучателя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				стр.Версия = Версия;
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли Действие = "Добавить" Тогда
		Если Сторона = "Отправитель" Тогда
			стр = об.ВерсииОтправителя.Найти(ЗаменяемаВерсия);
			Если стр = Неопределено Тогда
				стр = об.ВерсииОтправителя.Добавить();
				стр.Версия = Версия;
			КонецЕсли;
			
		Иначе
			стр = об.ВерсииПолучателя.Найти(ЗаменяемаВерсия);
			Если стр = Неопределено Тогда
				стр = об.ВерсииПолучателя.Добавить();
				стр.Версия = Версия;
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли Действие = "Удалить" Тогда
		Если Сторона = "Отправитель" Тогда
			стр = об.ВерсииОтправителя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				об.ВерсииОтправителя.Удалить(стр);
			КонецЕсли;
			
		Иначе
			стр = об.ВерсииПолучателя.Найти(ЗаменяемаВерсия);
			Если НЕ стр = Неопределено Тогда
				об.ВерсииПолучателя.Удалить(стр);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	об.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВерсиюОтправителя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Добавить", "Отправитель", Версия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВерсиюОтправителя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Заменить", "Отправитель", Версия, ЗаменяемаяВерсия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВерсиюОтправителя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Удалить", "Отправитель", Версия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВерсиюПолучателя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Добавить", "Получатель", Версия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВерсиюПолучателя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Заменить", "Получатель", Версия, ЗаменяемаяВерсия);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВерсиюПолучателя(Команда)
	
	Для каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьВерсии(ТекущаяСтрока, "Удалить", "Получатель", Версия);
	КонецЦикла;
	
КонецПроцедуры
